{
  "challenges": [
    {
      "id": 0,
      "title": "Start a Conversation",
      "level": 1,
      "description": "Start a conversation with a stranger at a coffee shop or store: For example, asking a barista how their day is going or complimenting someone's outfit.",
      "bestcase": "You have a great conversation and feel proud of yourself for taking a step out of your comfort zone.",
      "worstcase": "The conversation is awkward or uncomfortable, but you still feel proud for trying and the conversation partner will forget about it in a few minutes anyway.",
      "realcase": ""
    },
    {
      "id": 1,
      "title": "Join a group or club",
      "level": 1,
      "description": "Join a local group or club that interests you, such as a book club, hiking group, or art class.",
      "bestcase": "You meet new people who share your interests and enjoy participating in fun activities together.",
      "worstcase": "You feel a bit nervous or out of place at first, but as you continue to attend, you become more comfortable and start to make connections.",
      "realcase": ""
    },
    {
      "id": 2,
      "title": "Attend a social event",
      "level": 2,
      "description": "Attend a social event such as a party, networking event, or dinner with acquaintances.",
      "bestcase": "You have a great time meeting new people and feel proud of yourself for pushing through any initial nerves.",
      "worstcase": "You feel a bit uncomfortable or out of place, but you still manage to have some enjoyable conversations and you learn that it's okay to feel a bit awkward at times.",
      "realcase": ""
    },
    {
      "id": 3,
      "title": "Make small talk",
      "level": 2,
      "description": "Strike up a conversation with someone you don't know well and make small talk about their interests, hobbies, or work.",
      "bestcase": "You have a pleasant conversation and learn something new about the other person. You feel proud of yourself for initiating the conversation and taking a step out of your comfort zone.",
      "worstcase": "The conversation doesn't go as smoothly as you hoped, but you still managed to make an effort and learn from the experience.",
      "realcase": ""
    },
    {
      "id": 4,
      "title": "Express your opinion",
      "level": 3,
      "description": "Express your opinion on a topic during a group discussion or debate.",
      "bestcase": "You express your opinion confidently and respectfully, and the other members of the group listen and engage in a thoughtful conversation.",
      "worstcase": "Your opinion isn't well-received or doesn't contribute much to the conversation, but you still feel proud of yourself for speaking up and sharing your thoughts.",
      "realcase": ""
    },
    {
      "id": 5,
      "title": "Initiate plans with a friend",
      "level": 3,
      "description": "Initiate plans with a friend, such as inviting them to hang out or suggesting a new activity to do together.",
      "bestcase": "Your friend is excited about your idea and you have a great time together, strengthening your friendship and social skills.",
      "worstcase": "Your friend isn't available or interested, but you still feel proud of yourself for making the effort and being proactive about socializing.",
      "realcase": ""
    },
    {
      "id": 6,
      "title": "Organize a Social Event",
      "level": 4,
      "description": "Plan and host a social event, such as a small dinner party or game night with friends or acquaintances.",
      "bestcase": "You successfully plan and host a fun and enjoyable social event that helps you strengthen your social connections and build your confidence in social situations.",
      "worstcase": "Your event doesn't go as planned, and it may be uncomfortable or awkward at times. However, you can still learn from the experience and use the feedback to improve your future events.",
      "realcase": ""
    },
    {
      "id": 7,
      "title": "Attend a Networking Event",
      "level": 5,
      "description": "Attend a networking event or professional conference in your field of interest.",
      "bestcase": "You meet new people who are interested in your work, have great conversations, and potentially make valuable connections that can help advance your career or personal goals.",
      "worstcase": "You feel intimidated by the event and have difficulty engaging with people. You may feel like you wasted your time, but you can learn from the experience and try again in the future.",
      "realcase": ""
    },
    {
      "id": 8,
      "title": "Lead a Group Discussion",
      "level": 4,
      "description": "Lead a group discussion or presentation on a topic of your choice.",
      "bestcase": "You successfully engage your audience, generate lively discussion, and feel confident in your ability to lead and present information effectively.",
      "worstcase": "You struggle to keep the discussion going or feel like your presentation falls flat. However, you can learn from the experience and use feedback to improve your skills for future presentations.",
      "realcase": ""
    },
    {
      "id": 9,
      "title": "Travel to a New Place",
      "level": 5,
      "description": "Travel alone to a new place and explore without relying on others for support.",
      "bestcase": "You have a fantastic experience exploring new places and making your own decisions. You feel empowered and independent, and the experience helps build your confidence in navigating new situations.",
      "worstcase": "You may feel anxious or lonely at times, and it may be challenging to navigate unfamiliar surroundings. However, you can learn from the experience and use the skills and confidence you gain to tackle future challenges.",
      "realcase": ""
    },
    {
      "title": "Example",
      "description": "Example",
      "level": 2,
      "bestcase": "",
      "worstcase": "",
      "realcase": "",
      "id": 10
    },
    {
      "title": "EXAMPLE2",
      "description": "",
      "level": 1,
      "bestcase": "",
      "worstcase": "",
      "id": 11
    },
    {
      "title": "EXAMPLE3",
      "description": "",
      "level": 1,
      "bestcase": "",
      "worstcase": "",
      "id": 12
    }
  ]
}